Repository: svenh0/GithubPluginUpdater
Catalog: src/locale/*/LC_MESSAGES/GithubPluginUpdater.po
Languages: de, it

source: = GithubPluginUpdater = >>> there are updates for the following plugins !!! <<< %s open the GithubPluginUpdater for the update
de: = GithubPluginUpdater = >>> es liegen für folgende Plugins Updates vor !!! <<< %s zum Update den GithubPluginUpdater öffnen
it: = GithubPluginUpdater = >>> Sono presenti aggiornamenti per i seguenti plugin <<< %s Aprire GithubPluginUpdater per aggiornarli

source: = GithubPluginUpdater = no plugin updates found
de: = GithubPluginUpdater = keine Plugin-Updates gefunden
it: = GithubPluginUpdater = Nessun aggiornamento disponibile

source: state:
de: Status:
it: Stato:

source: (local version)
de: (lokale Version)
it: (versione locale)

source: (github version)
it: (versione github)

source: local versions was loaded
de: lokale Versionen wurden geladen
it: È stata caricata la versione locale

source: reload github-data
de: Neuladen der github-Daten
it: Ricaricare i dati github

source: close plugin
de: Plugin beenden
it: Chiudere il plugin

source: open the plugin-menu
de: Plugin-Menü öffnen
it: Aprire il menu del plugin

source: update-check for GithubPluginUpdater
de: Updateprüfung für GithubPluginUpdater
it: Verificare aggiornamenti per GithubPluginUpdater

source: advanced update-info for GithubPluginUpdater
de: erweiterte Update-Info für GithubPluginUpdater
it: Informazioni di aggiornamento avanzate per GithubPluginUpdater

source: update for
de: Update für
it: Aggiornamento per

source: forced update for
de: Zwangs-Update für
it: Aggiornamento forzato per

source: update-info for
de: Update-Info für
it: Info aggiornamento per

source: advanced update-info for
de: erweiterte Update-Info für
it: Info avanzate aggiornamento per

source: to reload the github-versions press 'OK' Keys 1-4 to show last github-update-info
de: zum Neuladen der github-Versionen 'OK' drücken Tasten 1-4 zur Anzeige der letzten Github-Update-Info
it: Per ricaricare la versione github premere "OK". Utilizzare i tasti 1-4 per mostrare le ultime info github-update

source: update check for GithubPluginUpdater:
de: Updateprüfung für GithubPluginUpdater:
it: Verificare aggiornamento per GithubPluginUpdater:

source: github version:
it: Versione github:

source: ... more infos in the advanced update-info ...
de: ... weitere Infos in der erweiterten Updatinfo ...
it: ...info dettagliate nelle info di aggiornamento avanzate...

source: A newer version exists!
de: Es existiert eine neuere Version!
it: È presente una nuova versione.

source: Do you want to start the update now?
de: Soll das Update jetzt gestartet werden?
it: Avviare l'aggiornamento?

source: local version:
de: lokale Version:
it: Versione locale:

source: The latest version is already being used!
de: Es wird bereits die aktuellste Version genutzt!
it: È già in uso l'ultima versione.

source: error on update-check
de: Fehler bei der Updateprüfung
it: Errore nella verifica degli aggiornamenti

source: update-check for GithubPluginUpdater load data ...
de: Updateprüfung für GithubPluginUpdater lade Daten ...
it: Verifica aggiornamenti per GithubPluginUpdater Caricamento dati in corso...

source: advanced github-update-infos for
de: erweiterte github-Update-Info für
it: Info avanzate aggiornamenti github per

source: for more update-infos please visit the github-website.
de: für weitere Update-Infos bitte die github-Website besuchen.
it: Per maggiori info sugli aggiornamenti visitare il sito web github.

source: github-date:
de: github-Datum:
it: data github:

source: last update-info for
de: letzte Update-Info für
it: Ultime info aggiornamenti per

source: No update info for %s could be found.
de: Es konnte keine Updateinfo für %s gefunden werden.
it: Info aggiornamenti per %s non trovate.

source: version:
it: Versione:

source: Do you want to start the github update now?
de: Soll das github-Update jetzt gestartet werden?
it: Avviare l'aggiornamento github ora?

source: Warning: Plugin versions in github are often still test versions and can cause certain problems after installation! Therefore, only experienced users should update to a github version. Should the github -Update start now?
de: Warnhinweis: Plugin-Versionen im github sind oft noch Test-Versionen und können gewisse Probleme nach der Installation verursachen! Daher sollten nur erfahrene User ein solches Update auf eine github-Version durchführen. Soll das github-Update jetzt gestartet werden?
it: Attenzione: Le versioni presenti su github sono spesso sperimentali e potrebbero provocare problemi dopo l'installazione. Pertanto solo utenti esperti dovrebbero effettuare l'aggiornamento a una versione github. Eseguire comunque l'aggiornamento github ora?

source: The update could not be started! The curl package must first be installed. The curl package can be installed in the plug-in using the menu button via the entry 'Install curl package on the box'! it is possible via telnet with the following command: opkg install curl
de: Das Update konnte nicht gestartet werden! Es muss erst das curl-Paket installiert werden. Das curl-Paket kann im Plugin per Menü-Taste über den Eintrag 'curl-Paket auf der Box installieren' installiert werden! per Telnet geht es z.B. mit folgendem Befehl: opkg install curl
it: Impossibile avviare l'aggiornamento. È necessario preventivamente installare il pacchetto curl. Il pacchetto curl può essere installato utilizzando la voce "Installare il pacchetto curl" raggiungibile con il tasto "MENU". L'installazione è anche possibile via telnet con il seguente comando: opkg install curl

source: (remaining query-limit: %(limit)s, limit-reset-time: %(time)s)
de: (Rest Abfrage-Limit: %(limit)s, Limit-Reset-Time: %(time)s)
it: (numero query residue: %(limit)s - ora reset limite: %(time)s)

source: load github-versions ...
de: lade github-Versionen ...
it: Caricamento versione GitHub in corso...

source: github-versions loaded
de: github-Versionen geladen
it: Versione github caricata

source: - with error
de: - mit Fehler
it: - con errori

source: - updates avaible
de: - Updates vorhanden
it: - aggiornamenti disponibili

source: - no updates avaible
de: - keine Updates vorhanden
it: - aggiornamenti non disponibili

source: There are not local github date values for all plugins that are used for version comparison. Therefore, these plugins are automatically offered as an update. There are the following options for the first time to save a local github date: 1. if all plugins on the box are actually up to date, then the menu button can be used to select the option 'set the current github date for all plugins' or 2. the respective plugins can be updated using the color button. Afterwards all plugins should be displayed as current.
it: Non sono disponibili valori di date locali github per tutti i plugin in uso per un confronto delle versioni. Pertanto questi plugin sono offerti automaticamente come aggiornamento. Sono disponibili le seguenti opzioni per salvare una data locale di GitHub la prima volta : 1. Se tutti i plugin installati sono effettivamente aggiornati, il tasto "MENU" può essere utilizzato per selezionare l'opzione "Impostare la data github corrente per tutti i plugin" oppure 2. I rispettivi plugin possono essere aggiornati usando il tasto colorato. In seguito tutti i plugin dovrebbero essere visualizzati come correnti.

source: setup
de: Einstellungen
it: Impostazioni

source: force update for
de: Erzwinge Update für
it: Forzare l'aggiornamento per

source: set the current github date for all plugins
de: setze für alle Plugins das aktuelle github-Datum
it: Impostare la data github corrente per tutti i plugin

source: delete the current github date for all plugins
de: lösche für alle Plugins das aktuelle github-Datum
it: Rimuovere la data github corrente per tutti i plugin

source: install curl-package on the box
de: curl-Paket auf der Box installieren
it: Installare il pacchetto curl

source: remove curl-package from the box
de: curl-Paket auf der Box deinstallieren
it: Disinstallare il pacchetto curl

source: restore plugin backup
de: Plugin-Backup wiederherstellen
it: Ripristinare un backup dei plugin

source: Should the curl package be installed?
de: Soll das curl-Paket installiert werden?
it: Installare il pacchetto curl?

source: Should the curl package be uninstalled?
de: Soll das curl-Paket deinstalliert werden?
it: Disinstallare il pacchetto curl?

source: restore backup for GithubPluginUpdater
de: Backup für GithubPluginUpdater wiederherstellen
it: Ripristinare backup di GithubPluginUpdater

source: restore backup for %s
it: Rirpistinare backup per %s

source: menu restore plugin backup
de: Menü Plugin-Backup wiederherstellen
it: Menu ripristino backup plugin

source: none of the possible plugins are installed on the box. a backup restore is therefore not possible.
de: keines der möglichen Plugins ist auf der Box installiert. Eine Backup-Wiederherstellung ist dadurch nicht möglich.
it: Nessuno dei plugin previsti risulta installato. Un ripristino dal backup è pertanto impossibile.

source: select backup for the plugin '%s'
de: Backup für das Plugin '%s' auswählen
it: Selezionare il backup per il plugin "%s"

source: no backups found for the plugin '%s'.
de: keine Backups für das Plugins '%s' gefunden.
it: Nessun backup trovato per "%s".

source: Are you sure you want to restore the subsequent backup for plugin '%s'? backup:
de: Soll das nachfolgende Backup für das Plugin '%s' wirklich wiederhergestellt werden? Backup:
it: Ripristinare il backup successivo per il plugin "%s"? Backup:

source: Backup restore for plugin '%s' failed. Maybe not all plugin files are in the following backup folder:
de: Die Backup-Wiederherstellung für das Plugin '%s' ist fehlgeschlagen Möglicherweise befinden sich nicht alle Plugin-Dateien im nachfolgenden Backup-Ordner:
it: Ripristino del backup per il plugin "%s" fallito. Forse non tutti i file dei plugin sono nella seguente directory di backup:

source: restore backup for the plugin -
de: Backup-Wiederherstellung für das Plugin -
it: Ripristino in corso del backup del plugin -

source: installed version before restore backup:
de: installierte Version vor der Backup-Wiederherstellung:
it: Versione installata prima del ripristino backup:

source: copy backup files ......
de: kopiere Backup-Dateien ......
it: Copia file di backup in corso...

source: copy SerienRecorder database ......
de: kopiere SerienRecorder-Datenbank ......
it: Copia del database di SerienRecorder in corso...

source: installed version after restore backup:
de: installierte Version nach der Backup-Wiederherstellung:
it: Versione installata dopo il ripristino backup:

source: Plugins have been updated! Do you want to restart the GUI now?
de: Es wurden Plugins aktualisiert! Soll jetzt ein GUI-Neustart durchgeführt werden?
it: Plugin aggiornato. Riavviare la GUI ora?

source: installed version before update:
de: installierte Version vor dem Update:
it: Versione installata prima dell'aggiornamento:

source: backup local version to:
de: sichere lokale Version in:
it: Backup della versione locale in:

source: backup SerienRecorder database ......
de: sichere SerienRecorder Datenbank ......
it: Backup del database di SerienRecorder in corso...

source: load current version from github......
de: lade aktuelle Version von Github......
it: Caricamento versione corrente da github in corso...

source: install current github version......
de: installiere aktuelle Github-Version......
it: Installazione versione github corrente in corso...

source: installed version after update:
de: installierte Version nach dem Update:
it: Versione installata dopo l'aggiornamento:

source: GithubPluginUpdater - update info
it: GithubPluginUpdater - Info aggiornamenti

source: = GithubPluginUpdater = >>> there are updates for the following plugins !!! <<< %s Should the GithubPluginUpdater be opened?
de: = GithubPluginUpdater = >>> es liegen für folgende Plugins Updates vor !!! <<< %s Soll der GithubPluginUpdater geöffnet werden?
it: = GithubPluginUpdater = >>> Sono presenti aggiornamenti per i seguenti plugin <<< %s Aprire GithubPluginUpdater?

source: Error github update info could not be determined.
de: Error Es konnte keine github-Update-Info ermittelt werden.
it: Errore Impossibile determinare informazioni di aggiornamento github.

source: The advanced update info could not be loaded. The hourly limit for github queries was reached!!
de: Die erweiterte Update-Info konnte nicht geladen werden. Das stündliche Limit für github-Abfragen wurde erreicht!!
it: Impossibile caricare info avanzate. Raggiunto il limite orario per le query su github.

source: query limit per hour:
de: Abfrage-Limit pro Stunde:
it: Limite query per ora:

source: remaining query limit:
de: Restliches Abfrage-Limit:
it: Limite query residuo:

source: limit reset time:
de: Limit-Reset-Zeit:
it: Ora reset del limite:

source: current time:
de: aktuelle Zeit:
it: Ora corrente:

source: waiting to reset:
de: Wartezeit bis Reset:
it: In attesa di reset:

source: Exit-button to close
de: Exit-Taste zum Beenden
it: Tasto "EXIT" per chiudere

source: No github update info could be determined.
de: Es konnte keine github-Update-Info ermittelt werden.
it: Impossibile determinare informazioni di aggiornamento su github.

source: Error No github update info could be determined.
de: Error Es konnte keine github-Update-Info ermittelt werden.
it: Errore. Impossibile determinare informazioni di aggiornamento su github.

source: show update info
it: Mostrare info aggiornamento

source: loading update info...
de: Lade Update-Info...
it: Caricamento info aggiornamento in corso...

source: exit-key for cancel
de: Exit-Taste zum Abbrechen
it: Tasto "EXIT" per annullare

source: Message
it: Messaggio

source: GithubPluginUpdater Setup
it: Impostazioni GithubPluginUpdater

source: Cancel
de: Abbrechen
it: Annullare

source: Update-Info
it: Info aggiornamento

source: Updatecheck and Info on starting the box
de: Updatecheck und Info beim Start der Box
it: Verificare aggiornamenti e info all'avvio del box

source: check on boxstart (also on GUI-Restart and start from Idle) for updates and show a message (none/only on updates/always). On 'always' show a message also if is not updates avaible.
de: Prüft beim Box-Start (auch GUI-Neustart und Start aus dem Idle) auf Updates und gibt eine Meldung aus (nein/nur bei Updates/immer). Bei 'immer' kommt auch eine Info-Meldung, dass kein Update verfügbar ist.
it: Verificare ad ogni avvio (compresi riavvi GUI e risvegli da idle) la presenza di aggiornamenti e mostrare un messaggio (mai/solo su aggiornamenti/sempre). Sempre mostrerà un messaggio anche in assenza di aggiornamenti.

source: interval of AutoUpdateCheck on boxstart
de: Intervall für AutoUpdateCheck beim Start der Box
it: Intervallo di AutoUpdateCheck su avvio box

source: set the check-interval of AutoUpdateCheck on boxstart. Within the interval there is no renewed update check when the box is started.
de: Legt den Prüf-Intervall für den AutoUpdateCheck beim Start der Box fest. Innerhalb des Intervalls erfolgt kein erneuter Update-Check beim Start der Box.
it: Impostare l'intervallo verifiche di AutoUpdateCheck all'avvio. Durante questo intervallo non verranno ripetute verifiche sugli aggiornamenti.

source: duration of update-info-window (in seconds)
de: Anzeigedauer für Update-Info-Fenster (in Sek)
it: Durata finestra info aggiornamenti (secondi)

source: set after how many seconds the update-info-window is closed (1-20 seconds, 0 = wait for key-press)
de: Legt fest, nach wieviel Sekunden das Update-Info-Fenster automatisch geschlossen wird (1-20 Sek., 0 = wartet auf Tastendruck)
it: Impostare il ritardo della chiusura automatica della finestra info aggiornamenti (1-20 secondi - 0 = attendere pressione tasto)

source: advanced update-info with question to open the plugin
de: erweiterte Update-Info mit Frage zum Öffnen des Plugins
it: Info aggiornamento avanzate con richiesta di aprire il plugin

source: show on update-info an additioal question, if you want to open directly the GithubPluginUpdater.
de: Zeigt beim Update-Hinweis zusätzlich eine Frage, ob man den GithubPluginUpdater direkt direkt öffnen möchte.
it: Mostrare su info aggiornamenti una richiesta aggiuntiva per aprire direttamente GithubPluginUpdater.

source: answer for question is default set to:
de: Antwort für Frage steht standardmäßig auf:
it: Risposta predefinita alla richiesta:

source: set the default answer to the question to open the GithubPluginUpdaters. on 'no' the plugin is not open automaically on timeout of the question.
de: Legt fest, welche Antwort für die Frage zum Öffnen des GithubPluginUpdaters standardmäßig vorausgewählt sein soll. Bei 'nein' öffnet sich das Plugin bei Zeitablauf der Frage nicht automatisch.
it: Impostare la risposta predefinita alla richiesta di apertura di GithubPluginUpdaters. "No" non aprirà automaticamente il plugin al timeout della richiesta.

source: update-check for %s on boxstart
de: Update-Check für %s bei Box-Start
it: Verificare aggiornamenti per %s all'avvio del box

source: set if you want to check for updates for this plugin on box-start.
de: Legt fest, ob für das Plugin beim Box-Start eine Update-Prüfung durchgeführt werden soll.
it: Impostare una verifica aggiornamenti per questo plugin all'avvio del box.

source: option to check for github-updates / alternative
de: Variante zum Prüfen auf github-Updates / Alternative
it: Opzioni per la verifica di aggiornamenti github/alternative

source: There are 3 options for the update check. The most reliable option is the 'api call', which has an access restriction of 60 calls per hour. A relapse alternative can be chosen at api.
de: Es gibt 3 Varianten zur Update-Prüfung. Am zuverlässigstens ist die Variante 'api-Abruf', welche eine Zugriffsbeschränkung von 60 Abrufen pro Stunde hat. Bei api kann eine Rückfall-Alternative gewählt werden.
it: Sono disponibili 3 opzioni di verifica aggiornamenti. L'opzione più affidabile è la "api-call", con una restrizione di accesso a 60 chiamate/ora. Con le api, è possibile selezionare un'alternativa di ripiego.

source: check only the src-folder
de: Prüfe nur den src-Ordner
it: Verificare solo la directory src

source: Checks only the src folder for an update. Irrelevant updates outside of this folder are ignored, since only the src folder is updated anyway.
de: Prüft nur den src-Ordner auf ein Update. Dabei werden unrelevante Updates außerhalb dieses Ordners ignoriert, da eh nur der src-Ordner geupdatet wird.
it: Verificare solo la directory src per gli aggiornamenti. Gli aggiornamenti irrilevanti al di fuori di questa directory verranno ignorati, poiché in ogni caso solo la cartella src sarà aggiornata.

source: show warning before a github update
de: Warnhinweis vor einem github-Update anzeigen
it: Mostrare un avviso prima di un aggiornamento github

source: The warning before a github update on the possible consequences of such an update can be activated or deactivated here.
de: Der Warnhinweis vor einem github-Update zu den möglichen Folgen eines solchen Updates kann hier aktiviert bzw. deaktiviert werden.
it: Qui è possibile attivare/disattivare un avviso prima di aggiornamenti github sulle possibili conseguenze di tali operazioni.

source: create a backup of the plugin before update
de: erzeuge ein Backup des Plugins vor dem Update
it: Creare un backup del plugin prima di aggiornare

source: create a backup from the local plugin before update the guthub-version.
de: Legt vor dem Update der Github-Version ein Backup des lokalen Plugins an.
it: Creare un backup del plugin locale prima di aggiornarlo con la versione github.

source: storage location for the plugin backup
de: Speicherort für das Plugin-Backup
it: Posizione di archiviazione dei backup dei plugin

source: Defines the location for the plugin backup (selection with OK). The path is supplemented by the local plugin version number and date/time.
de: Legt den Ort für das Plugin-Backup fest (Auswahl mit OK). Der Pfad wird noch durch die lokale Plugin-Versionsnummer und Datum/Zeit ergänzt.
it: Definire la posizione dei backup dei plugin ("OK" per selezionare). Il percorso verrà completato con il numero di versione locale del plugin e data/ora.

source: Choose Directory:
de: wähle das Verzeichnis:
it: Selezionare la directory:

source: Choose directory
de: wähle das Verzeichnis
it: Selezionare la directory

source: Info only on updates
de: Info nur bei Updates
it: Info solo sugli aggiornamenti

source: always
de: immer
it: Sempre

source: yes
de: ja
it: Sì

source: normal website
de: normale Website
it: Sito web standard

source: commits-list
de: commits-Liste
it: Elenco commit

source: api-call / normal website
de: api-Abruf / normale Website
it: api-call/Sito web standard

source: api-call / commits-list
de: api-Abruf / commits-Liste
it: api-call/Elenco commit

source: hourly
de: stündlich
it: Ogni ora

source: every 6 hours
de: alle 6 Stunden
it: Ogni 6 ore

source: every 12 hours
de: alle 12 Stunden
it: Ogni 12 ore

source: daily
de: täglich
it: Giornaliera

source: weekly
de: wöchentlich
it: Settimanale

source: monthly
de: monatlich
it: Mensile

source: update github-versions
de: github-Versionen updaten
it: Aggiornare la versione github

source: menu
de: Menü

source: There are not local github date values ​​for all plugins that are used for version comparison. Therefore, these plugins are automatically offered as an update. There are the following options for the first time to save a local github date: 1. if all plugins on the box are actually up to date, then the menu button can be used to select the option "set the current github date for all plugins" or 2. the respective plugins can be updated using the color button. Afterwards all plugins should be displayed as current.
de: Es existieren nicht für alle Plugins lokale github-Datumswerte, die zum Versionsvergleich genutzt werden. Daher werden diese Plugins automatisch als Update angeboten. Es gibt folgende Möglichkeiten erstmals ein lokales github-Datum zu speichern: 1. wenn alle Plugins auf der Box tatsächlich aktuell sind, dann kann per Menü-Taste die Option "setze für alle Plugins das aktuelle github-Datum" gewählt werden oder 2. die jeweiligen Plugins können per Farb-Taste aktualisiert werden. Danach sollten alle Plugins als aktuell angezeigt werden.

source: menu GithubPluginUpdater
de: Menü GithubPluginUpdater

source: restor backup for %s
de: Backup für %s wiederherstellen

source: no
de: nein
